# 1 завдання: списки 

C = [10.0, 15.5, 17.1, 17.6, 19.0, 19.9, 25.0, 25.8, 28.0, 29.0, 30.1]


F = [round(temp * 9/5 + 32, 1) for temp in C]
print(F[::-1])

print("Всього вимірювань:",len(F))


# 2 завдання: кортежі

grades = (4, 5, 4, 4, 3, 5, 3, 3, 2, 5, 5, 5)

if 2 in grades :
  print('Студент має принаймні одну двійку з дисципліни!')
else:
  print('Студент вчиться без двійок')


# 3 завдання: словники

students = {"Васильєв":3.5, "Семенов":4.0, "Петров":4.5, "Іванов":3.0, "Мар'їн":5.0}
for student in students.keys():

  students.update({
    student: students[student] + 1 if students[student] + 1 <= 5 else 5.0
  })

print(students) # додав принт бо треба побачити що вийде


# 4 завдання: множини

responces = ["Іванов", "Петров", "Сидоров", "Васильєв", "Семенов", "Іванов", "Мар'їн", "Сидоров", "Дмитрієв", "Іванов"]
print("Всього анкет заповнено:",len(responces))

# вам треба дописати/змінити цей блок коду
respondents = set(responces)
# кінець вашого коду

print("Всього респондентів:",len(respondents))